export const SHARED_STAT_INFO = [
  {
    name: "최종 데미지 증가",
    reqPoints: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
    effects: [
      {
        name: "최종 데미지 증가",
        values: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 16, 18, 20],
        unit: "%",
      },
    ],
  },
  {
    name: "최대 체력 증가",
    reqPoints: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
    effects: [
      {
        name: "최대 체력 증가",
        values: [
          0, 100, 200, 300, 400, 500, 600, 700, 800, 900, 1000, 1200, 1400,
          1600, 1800, 2000,
        ],
        unit: "",
      },
    ],
  },
  {
    name: "이동 속도 증가",
    reqPoints: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
    effects: [
      {
        name: "이동 속도 증가",
        values: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 16, 18, 20],
        unit: "%",
      },
    ],
  },
  {
    name: "최대 마나 & 마나 회복량 증가",
    reqPoints: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
    effects: [
      {
        name: "최대 마나 증가",
        values: [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 24, 28, 32, 36, 40],
        unit: "",
      },
      {
        name: "마나 회복량 증가",
        values: [
          0, 0.02, 0.04, 0.06, 0.08, 0.1, 0.12, 0.14, 0.16, 0.18, 0.2, 0.24,
          0.28, 0.32, 0.4,
        ],
        unit: "",
      },
    ],
  },
  {
    name: "경험치 획득량 증가",
    reqPoints: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
    effects: [
      {
        name: "경험치 획득량 증가",
        values: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 16, 18, 20],
        unit: "%",
      },
    ],
  },
  {
    name: "디바인 스톤 추가 획득",
    reqPoints: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
    effects: [
      {
        name: "디바인 스톤 추가 획득",
        values: [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 24, 28, 32, 36, 40],
        unit: "%",
      },
    ],
  },
];

export const SHARDS = [
  {
    id: "town7",
    name: "디바인 샤드",
    maxLevel: 15,
    pointsPerLevel: 10,
    maxStatLevel: 15,
    validStats: ["최종 데미지 증가", "최대 마나 & 마나 회복량 증가"],
  },
  {
    id: "town8",
    name: "늪의 디바인 샤드",
    maxLevel: 15,
    pointsPerLevel: 8,
    maxStatLevel: 10,
    validStats: ["최종 데미지 증가", "최대 마나 & 마나 회복량 증가"],
  },
];
